xieliwei/ArduinoCore-AT32F/boards.txt
CustomAT32F415.menu.pll_clock_source.hext_div2=High-Speed External Crystal divided by 2
CustomAT32F415.menu.pll_clock_source.hext_div2.build.f_pll_clock_source=2
CustomAT32F415.menu.pll_clock_source.hext_div1=High-Speed External Crystal divided by 1
CustomAT32F415.menu.pll_clock_source.hext_div1.build.f_pll_clock_source=1
CustomAT32F415.menu.pll_clock_source.hsi_div12=High-Speed Internal Clock (48 MHz) divided by 12
CustomAT32F415.menu.pll_clock_source.hsi_div12.build.f_pll_clock_source=0

CustomAT32F415.menu.pll_mult.pll_mult_64=PLL Multiplication Factor 64
CustomAT32F415.menu.pll_mult.pll_mult_64.build.f_pll_mult=CRM_PLL_MULT_64
CustomAT32F415.menu.pll_mult.pll_mult_63=PLL Multiplication Factor 63
CustomAT32F415.menu.pll_mult.pll_mult_63.build.f_pll_mult=CRM_PLL_MULT_63
CustomAT32F415.menu.pll_mult.pll_mult_62=PLL Multiplication Factor 62
CustomAT32F415.menu.pll_mult.pll_mult_62.build.f_pll_mult=CRM_PLL_MULT_62
CustomAT32F415.menu.pll_mult.pll_mult_61=PLL Multiplication Factor 61
CustomAT32F415.menu.pll_mult.pll_mult_61.build.f_pll_mult=CRM_PLL_MULT_61
CustomAT32F415.menu.pll_mult.pll_mult_60=PLL Multiplication Factor 60
CustomAT32F415.menu.pll_mult.pll_mult_60.build.f_pll_mult=CRM_PLL_MULT_60
CustomAT32F415.menu.pll_mult.pll_mult_59=PLL Multiplication Factor 59
CustomAT32F415.menu.pll_mult.pll_mult_59.build.f_pll_mult=CRM_PLL_MULT_59
CustomAT32F415.menu.pll_mult.pll_mult_58=PLL Multiplication Factor 58
CustomAT32F415.menu.pll_mult.pll_mult_58.build.f_pll_mult=CRM_PLL_MULT_58
CustomAT32F415.menu.pll_mult.pll_mult_57=PLL Multiplication Factor 57
CustomAT32F415.menu.pll_mult.pll_mult_57.build.f_pll_mult=CRM_PLL_MULT_57
CustomAT32F415.menu.pll_mult.pll_mult_56=PLL Multiplication Factor 56
CustomAT32F415.menu.pll_mult.pll_mult_56.build.f_pll_mult=CRM_PLL_MULT_56
CustomAT32F415.menu.pll_mult.pll_mult_55=PLL Multiplication Factor 55
CustomAT32F415.menu.pll_mult.pll_mult_55.build.f_pll_mult=CRM_PLL_MULT_55
CustomAT32F415.menu.pll_mult.pll_mult_54=PLL Multiplication Factor 54
CustomAT32F415.menu.pll_mult.pll_mult_54.build.f_pll_mult=CRM_PLL_MULT_54
CustomAT32F415.menu.pll_mult.pll_mult_53=PLL Multiplication Factor 53
CustomAT32F415.menu.pll_mult.pll_mult_53.build.f_pll_mult=CRM_PLL_MULT_53
CustomAT32F415.menu.pll_mult.pll_mult_52=PLL Multiplication Factor 52
CustomAT32F415.menu.pll_mult.pll_mult_52.build.f_pll_mult=CRM_PLL_MULT_52
CustomAT32F415.menu.pll_mult.pll_mult_51=PLL Multiplication Factor 51
CustomAT32F415.menu.pll_mult.pll_mult_51.build.f_pll_mult=CRM_PLL_MULT_51
CustomAT32F415.menu.pll_mult.pll_mult_50=PLL Multiplication Factor 50
CustomAT32F415.menu.pll_mult.pll_mult_50.build.f_pll_mult=CRM_PLL_MULT_50
CustomAT32F415.menu.pll_mult.pll_mult_49=PLL Multiplication Factor 49
CustomAT32F415.menu.pll_mult.pll_mult_49.build.f_pll_mult=CRM_PLL_MULT_49
CustomAT32F415.menu.pll_mult.pll_mult_48=PLL Multiplication Factor 48
CustomAT32F415.menu.pll_mult.pll_mult_48.build.f_pll_mult=CRM_PLL_MULT_48
CustomAT32F415.menu.pll_mult.pll_mult_47=PLL Multiplication Factor 47
CustomAT32F415.menu.pll_mult.pll_mult_47.build.f_pll_mult=CRM_PLL_MULT_47
CustomAT32F415.menu.pll_mult.pll_mult_46=PLL Multiplication Factor 46
CustomAT32F415.menu.pll_mult.pll_mult_46.build.f_pll_mult=CRM_PLL_MULT_46
CustomAT32F415.menu.pll_mult.pll_mult_45=PLL Multiplication Factor 45
CustomAT32F415.menu.pll_mult.pll_mult_45.build.f_pll_mult=CRM_PLL_MULT_45
CustomAT32F415.menu.pll_mult.pll_mult_44=PLL Multiplication Factor 44
CustomAT32F415.menu.pll_mult.pll_mult_44.build.f_pll_mult=CRM_PLL_MULT_44
CustomAT32F415.menu.pll_mult.pll_mult_43=PLL Multiplication Factor 43
CustomAT32F415.menu.pll_mult.pll_mult_43.build.f_pll_mult=CRM_PLL_MULT_43
CustomAT32F415.menu.pll_mult.pll_mult_42=PLL Multiplication Factor 42
CustomAT32F415.menu.pll_mult.pll_mult_42.build.f_pll_mult=CRM_PLL_MULT_42
CustomAT32F415.menu.pll_mult.pll_mult_41=PLL Multiplication Factor 41
CustomAT32F415.menu.pll_mult.pll_mult_41.build.f_pll_mult=CRM_PLL_MULT_41
CustomAT32F415.menu.pll_mult.pll_mult_40=PLL Multiplication Factor 40
CustomAT32F415.menu.pll_mult.pll_mult_40.build.f_pll_mult=CRM_PLL_MULT_40
CustomAT32F415.menu.pll_mult.pll_mult_39=PLL Multiplication Factor 39
CustomAT32F415.menu.pll_mult.pll_mult_39.build.f_pll_mult=CRM_PLL_MULT_39
CustomAT32F415.menu.pll_mult.pll_mult_38=PLL Multiplication Factor 38
CustomAT32F415.menu.pll_mult.pll_mult_38.build.f_pll_mult=CRM_PLL_MULT_38
CustomAT32F415.menu.pll_mult.pll_mult_37=PLL Multiplication Factor 37
CustomAT32F415.menu.pll_mult.pll_mult_37.build.f_pll_mult=CRM_PLL_MULT_37
CustomAT32F415.menu.pll_mult.pll_mult_36=PLL Multiplication Factor 36
CustomAT32F415.menu.pll_mult.pll_mult_36.build.f_pll_mult=CRM_PLL_MULT_36
CustomAT32F415.menu.pll_mult.pll_mult_35=PLL Multiplication Factor 35
CustomAT32F415.menu.pll_mult.pll_mult_35.build.f_pll_mult=CRM_PLL_MULT_35
CustomAT32F415.menu.pll_mult.pll_mult_34=PLL Multiplication Factor 34
CustomAT32F415.menu.pll_mult.pll_mult_34.build.f_pll_mult=CRM_PLL_MULT_34
CustomAT32F415.menu.pll_mult.pll_mult_33=PLL Multiplication Factor 33
CustomAT32F415.menu.pll_mult.pll_mult_33.build.f_pll_mult=CRM_PLL_MULT_33
CustomAT32F415.menu.pll_mult.pll_mult_32=PLL Multiplication Factor 32
CustomAT32F415.menu.pll_mult.pll_mult_32.build.f_pll_mult=CRM_PLL_MULT_32
CustomAT32F415.menu.pll_mult.pll_mult_31=PLL Multiplication Factor 31
CustomAT32F415.menu.pll_mult.pll_mult_31.build.f_pll_mult=CRM_PLL_MULT_31
CustomAT32F415.menu.pll_mult.pll_mult_30=PLL Multiplication Factor 30
CustomAT32F415.menu.pll_mult.pll_mult_30.build.f_pll_mult=CRM_PLL_MULT_30
CustomAT32F415.menu.pll_mult.pll_mult_29=PLL Multiplication Factor 29
CustomAT32F415.menu.pll_mult.pll_mult_29.build.f_pll_mult=CRM_PLL_MULT_29
CustomAT32F415.menu.pll_mult.pll_mult_28=PLL Multiplication Factor 28
CustomAT32F415.menu.pll_mult.pll_mult_28.build.f_pll_mult=CRM_PLL_MULT_28
CustomAT32F415.menu.pll_mult.pll_mult_27=PLL Multiplication Factor 27
CustomAT32F415.menu.pll_mult.pll_mult_27.build.f_pll_mult=CRM_PLL_MULT_27
CustomAT32F415.menu.pll_mult.pll_mult_26=PLL Multiplication Factor 26
CustomAT32F415.menu.pll_mult.pll_mult_26.build.f_pll_mult=CRM_PLL_MULT_26
CustomAT32F415.menu.pll_mult.pll_mult_25=PLL Multiplication Factor 25
CustomAT32F415.menu.pll_mult.pll_mult_25.build.f_pll_mult=CRM_PLL_MULT_25
CustomAT32F415.menu.pll_mult.pll_mult_24=PLL Multiplication Factor 24
CustomAT32F415.menu.pll_mult.pll_mult_24.build.f_pll_mult=CRM_PLL_MULT_24
CustomAT32F415.menu.pll_mult.pll_mult_23=PLL Multiplication Factor 23
CustomAT32F415.menu.pll_mult.pll_mult_23.build.f_pll_mult=CRM_PLL_MULT_23
CustomAT32F415.menu.pll_mult.pll_mult_22=PLL Multiplication Factor 22
CustomAT32F415.menu.pll_mult.pll_mult_22.build.f_pll_mult=CRM_PLL_MULT_22
CustomAT32F415.menu.pll_mult.pll_mult_21=PLL Multiplication Factor 21
CustomAT32F415.menu.pll_mult.pll_mult_21.build.f_pll_mult=CRM_PLL_MULT_21
CustomAT32F415.menu.pll_mult.pll_mult_20=PLL Multiplication Factor 20
CustomAT32F415.menu.pll_mult.pll_mult_20.build.f_pll_mult=CRM_PLL_MULT_20
CustomAT32F415.menu.pll_mult.pll_mult_19=PLL Multiplication Factor 19
CustomAT32F415.menu.pll_mult.pll_mult_19.build.f_pll_mult=CRM_PLL_MULT_19
CustomAT32F415.menu.pll_mult.pll_mult_18=PLL Multiplication Factor 18
CustomAT32F415.menu.pll_mult.pll_mult_18.build.f_pll_mult=CRM_PLL_MULT_18
CustomAT32F415.menu.pll_mult.pll_mult_17=PLL Multiplication Factor 17
CustomAT32F415.menu.pll_mult.pll_mult_17.build.f_pll_mult=CRM_PLL_MULT_17
CustomAT32F415.menu.pll_mult.pll_mult_16=PLL Multiplication Factor 16
CustomAT32F415.menu.pll_mult.pll_mult_16.build.f_pll_mult=CRM_PLL_MULT_16
CustomAT32F415.menu.pll_mult.pll_mult_15=PLL Multiplication Factor 15
CustomAT32F415.menu.pll_mult.pll_mult_15.build.f_pll_mult=CRM_PLL_MULT_15
CustomAT32F415.menu.pll_mult.pll_mult_14=PLL Multiplication Factor 14
CustomAT32F415.menu.pll_mult.pll_mult_14.build.f_pll_mult=CRM_PLL_MULT_14
CustomAT32F415.menu.pll_mult.pll_mult_13=PLL Multiplication Factor 13
CustomAT32F415.menu.pll_mult.pll_mult_13.build.f_pll_mult=CRM_PLL_MULT_13
CustomAT32F415.menu.pll_mult.pll_mult_12=PLL Multiplication Factor 12
CustomAT32F415.menu.pll_mult.pll_mult_12.build.f_pll_mult=CRM_PLL_MULT_12
CustomAT32F415.menu.pll_mult.pll_mult_11=PLL Multiplication Factor 11
CustomAT32F415.menu.pll_mult.pll_mult_11.build.f_pll_mult=CRM_PLL_MULT_11
CustomAT32F415.menu.pll_mult.pll_mult_10=PLL Multiplication Factor 10
CustomAT32F415.menu.pll_mult.pll_mult_10.build.f_pll_mult=CRM_PLL_MULT_10
CustomAT32F415.menu.pll_mult.pll_mult_9=PLL Multiplication Factor 9
CustomAT32F415.menu.pll_mult.pll_mult_9.build.f_pll_mult=CRM_PLL_MULT_9
CustomAT32F415.menu.pll_mult.pll_mult_8=PLL Multiplication Factor 8
CustomAT32F415.menu.pll_mult.pll_mult_8.build.f_pll_mult=CRM_PLL_MULT_8
CustomAT32F415.menu.pll_mult.pll_mult_7=PLL Multiplication Factor 7
CustomAT32F415.menu.pll_mult.pll_mult_7.build.f_pll_mult=CRM_PLL_MULT_7
CustomAT32F415.menu.pll_mult.pll_mult_6=PLL Multiplication Factor 6
CustomAT32F415.menu.pll_mult.pll_mult_6.build.f_pll_mult=CRM_PLL_MULT_6
CustomAT32F415.menu.pll_mult.pll_mult_5=PLL Multiplication Factor 5
CustomAT32F415.menu.pll_mult.pll_mult_5.build.f_pll_mult=CRM_PLL_MULT_5
CustomAT32F415.menu.pll_mult.pll_mult_4=PLL Multiplication Factor 4
CustomAT32F415.menu.pll_mult.pll_mult_4.build.f_pll_mult=CRM_PLL_MULT_4
CustomAT32F415.menu.pll_mult.pll_mult_3=PLL Multiplication Factor 3
CustomAT32F415.menu.pll_mult.pll_mult_3.build.f_pll_mult=CRM_PLL_MULT_3
CustomAT32F415.menu.pll_mult.pll_mult_2=PLL Multiplication Factor 2
CustomAT32F415.menu.pll_mult.pll_mult_2.build.f_pll_mult=CRM_PLL_MULT_2

CustomAT32F415.menu.upload_method.USBDFUMethod=Artery DFU ISP
CustomAT32F415.menu.upload_method.USBDFUMethod.upload.protocol=Artery_ISP
CustomAT32F415.menu.upload_method.USBDFUMethod.upload.tool=Artery_ISP_Console
CustomAT32F415.menu.upload_method.USBDFUMethod.upload.maximum_size=1048576